---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricationStartOffsetParam
source: html/470cd180-f1b1-77a0-9e78-a850ac612d2d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricationStartOffsetParam Property

"Start Middle Elevation"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricationStartOffsetParam { get; }
```